Merge pull request #3963 from shakenfist/sync-docs
Automated documentation sync for 20260829.
